# Pandas

- [Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe. ](#question1)

- [Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names](#question2)

- [How to get the items of series A not present in series B .From ser1 remove items present in ser2](#question3)
    ```python
    ser1 = pd.Series([2,3,4,5])
    ser2 = pd.Series([5,6,7,8])
    ```

## Questions on Titanic Dataset:

- [Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset](#question4)

- [How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset](#question5)

- [Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset](#question6)

- [Bin the price column in titanic dataset into 5 equal groups and get counts of each bin](#question7)

- [Count the number of missing values in each column?](#question8)

- [Get the row number of the 5th largest value in the Age column of the titanic dataset.](#question9)

- [Normalize all columns in a dataframe?](#question10)

- [Get the indices of items of ser2 in ser1 as a list](#question11)
    ```python
    ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
    ser2 = pd.Series([1,3,10,13])
    ```

- [How to convert a series of date-strings to a timeseries?](#question12)
    ```
    ['01 Jan 2010','02-02-2011','20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20']
    ```

- [Get the day of month, week number, day of year and day of week from ser.](#question13)
    ```python
    ser =pd.Series(['01 Jan 2010','02-02-2011','20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
    ```

- [Compute the euclidean distance between series p and q, without using a packaged formula](#question14)
    ```python
    p = pd.Series([1,2,3,4,5,6,7,8,9,10])
    q = pd.Series([10,9,8,7,6,5,4,3,2,1])
    ```
- [How to create a TimeSeries starting '2000-01-01' and 10 weekends (saturdays/sundays)](#question15)

- [Import every 50th row of BostonHousing dataset as a dataframe](#question16)

In [1]:
import pandas as pd
import numpy as np

<a id=question1></a>
### Question 1

#### Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

In [2]:
index = pd.date_range('2019',periods=365, freq='D')
values = np.random.randint(low=0, high=365,size=(365,))
df = pd.DataFrame(values, index=index, columns=['random'])
df

            random
2019-01-01      19
2019-01-02     142
2019-01-03     231
2019-01-04     323
2019-01-05     193
...            ...
2019-12-27      90
2019-12-28     325
2019-12-29      97
2019-12-30     238
2019-12-31     144

[365 rows x 1 columns]

<a id='question2'></a>
### Question 2
#### Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names

In [3]:
height = [23, 42, 55]
weight = [71, 32, 48]

column_names = ['height', 'weight']
df = pd.DataFrame(np.array([height,weight]).T, columns= column_names)
df

   height  weight
0      23      71
1      42      32
2      55      48

<a id='question3'></a>

### Question 3
#### How to get the items of series A not present in series B .From ser1 remove items present in ser2.

```
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])
```

In [4]:
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])

serA_not_in_serB = ser1[~ser1.isin(ser2)]

# print("ser1:\n", ser1)

print("\nItems of series A not present in series B:")
print(serA_not_in_serB)

Items of series A not present in series B:
0    2
1    3
2    4
dtype: int64

<a id='question4'></a>

## Questions on Titanic Dataset

### Question 4
#### Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [5]:
titanic = pd.read_csv("../../datasets/titanic.csv")

age_stats = titanic.Age.describe()

print("Minimum Age:", age_stats['min'])
print("25th percentile Age:", age_stats['25%'])
print("Median Age:", age_stats['50%'])
print("75th percentile Age:", age_stats['75%'])
print("Maximum Age:", age_stats['max'])

Minimum Age: 0.42
25th percentile Age: 20.125
Median Age: 28.0
75th percentile Age: 38.0
Maximum Age: 80.0

<a id=question5></a>
### Question 5
#### How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

* To get the frequency counts of unique items of a series we will use value_counts() function in series

In [6]:
titanic.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

<a id=question6></a>
### Question 6
#### Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

In [7]:
records = titanic['Embarked'].value_counts()[:2]
titanic.loc[~titanic['Embarked'].isin(records.keys()), 'Embarked'] = 'Other'

<a id=question7></a>
### Question 7
#### Bin the price column in titanic dataset into 5 equal groups and get counts of each bin

In [8]:
titanic.Fare.describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

As we can see from above mean>median => Fare is right skewed.

In [9]:
titanic.Fare = pd.cut(titanic.Fare, bins = [0, 8, 15, 30, 100, 512])
titanic.Fare.value_counts()

(0, 8]        226
(8, 15]       217
(15, 30]      199
(30, 100]     181
(100, 512]     50
Name: Fare, dtype: int64

<a id=question8></a>
### Question 8
#### Count the number of missing values in each column?

In [10]:
titanic.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare            18
Cabin          687
Embarked         0
dtype: int64

<a id=question9></a>
### Question 9
#### Get the row number of the 5th largest value in the Age column of the titanic dataset.

In [11]:
titanic.Age.sort_values(ascending=False).reset_index(drop=True).iloc[4]

70.5

<a id=question10></a>
### Question 10
#### Normalize all columns in a dataframe?

In [12]:
height = [23, 42, 55]
weight = [71, 32, 48]

column_names = ['height', 'weight']
df = pd.DataFrame(np.array([height,weight]).T, columns= column_names)

#normalizing all numeric columns
df_normalized = (df-df.min())/(df.max()-df.min())
df_normalized

    height    weight
0  0.00000  1.000000
1  0.59375  0.000000
2  1.00000  0.410256

<a id=question11></a>
### Question 11 

### Get the indices of items of ser2 in ser1 as a list

```python
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])
```

In [13]:
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])

ser1.index[ser1.isin(ser2)].tolist()

[0, 4, 5, 8]

<a id=question12></a>
### Question 12

#### How to convert a series of date-strings to a timeseries?

```
['01 Jan 2010','02-02-2011','20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20']
```

In [14]:
dates = ['01 Jan 2010','02-02-2011','20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20']

date_series = pd.to_datetime(dates)

date_series

DatetimeIndex(['2010-01-01 00:00:00', '2011-02-02 00:00:00',
               '2012-03-03 00:00:00', '2013-04-04 00:00:00',
               '2014-05-05 00:00:00', '2015-06-06 12:20:00'],
              dtype='datetime64[ns]', freq=None)

<a id=question13></a>
### Question 13
#### Get the day of month, week number, day of year and day of week from ser.

```python
ser = pd.Series(['01 Jan 2010','02-02-2011','20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
```

In [15]:
ser = pd.Series(['01 Jan 2010','02-02-2011','20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])


df_ser = pd.DataFrame(ser, columns=['ser'])

date_series = pd.to_datetime(ser)

df_ser['day_month'] = date_series.dt.day
df_ser['weeks']      = date_series.dt.isocalendar().week
df_ser['day_yr']    = date_series.dt.day_of_year
df_ser['day_week']  = date_series.dt.day_of_week

df_ser

                ser  day_month  weeks  day_yr  day_week
0       01 Jan 2010          1     53       1         4
1        02-02-2011          2      5      33         2
2          20120303          3      9      63         5
3        2013/04/04          4     14      94         3
4        2014-05-05          5     19     125         0
5  2015-06-06T12:20          6     23     157         5

<a id=question14></a>
### Question 14
#### Compute the euclidean distance between series p and q, without using a packaged formula

```python
p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])
```

In [16]:
p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])

euclidean_distance = np.sqrt(np.sum((p-q)**2))
print("Euclidean Distance:", euclidean_distance)

Euclidean Distance: 18.16590212458495

<a id=question15></a>
### Question 15
#### How to create a TimeSeries starting '2000-01-01' and 10 weekends (saturdays/sundays)

In [17]:
pd.date_range('2000-01-01', periods=10, freq='W')

DatetimeIndex(['2000-01-02', '2000-01-09', '2000-01-16', '2000-01-23',
               '2000-01-30', '2000-02-06', '2000-02-13', '2000-02-20',
               '2000-02-27', '2000-03-05'],
              dtype='datetime64[ns]', freq='W-SUN')

<a id=question16></a>
### Question 16
#### Import every 50th row of BostonHousing dataset as a dataframe

In [18]:
boston = pd.read_csv("../../datasets/boston_house_price.csv")

fifty_boston = boston.iloc[lambda x: (x.index+1)%50 == 0]
fifty_boston

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
49,0.21977,0.0,6.91,0.0,0.448,5.602,62.0,6.0877,3.0,233.0,17.9,396.90,16.20,19.4
99,0.06860,0.0,2.89,0.0,0.445,7.416,62.5,3.4952,2.0,276.0,18.0,396.90,6.19,33.2
149,2.73397,0.0,19.58,0.0,0.871,5.597,94.9,1.5257,5.0,403.0,14.7,351.85,21.45,15.4
199,0.03150,95.0,1.47,0.0,0.403,6.975,15.3,7.6534,3.0,402.0,17.0,396.90,4.56,34.9
249,0.19073,22.0,5.86,0.0,0.431,6.718,17.5,7.8265,7.0,330.0,19.1,393.74,6.56,26.2
299,0.05561,70.0,2.24,0.0,0.400,7.041,10.0,7.8278,5.0,358.0,14.8,371.58,4.74,29.0
349,0.02899,40.0,1.25,0.0,0.429,6.939,34.5,8.7921,1.0,335.0,19.7,389.85,5.89,26.6
399,9.91655,0.0,18.10,0.0,0.693,5.852,77.8,1.5004,24.0,666.0,20.2,338.16,29.97,6.3
449,7.52601,0.0,18.10,0.0,0.713,6.417,98.3,2.1850,24.0,666.0,20.2,304.21,19.31,13.0
499,0.17783,0.0,9.69,0.0,0.585,5.569,73.5,2.3999,6.0,391.0,19.2,395.77,15.10,17.5